session02/lab02.org
#+TITLE:  Computer Science Fundamentals
#+AUTHOR: Detroit Labs Dev Coaching
#+DATE:   2018
#+EMAIL:  ndotz@detroitlabs.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc timestamp:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_THEME: league
#+REVEAL_MARGIN: 0.2
# #+REVEAL_MIN_SCALE: 0.5
# #+REVEAL_MAX_SCALE: 2.5
#+REVEAL_EXTRA_CSS: ./presentation.css

* Lab 2
  #+BEGIN_NOTES
  - To go along with our discussion of data structures and algorithms,
    this section of the book is going to introduce some of the tools
    that will assist us in developing more complicated data structures
    and algorithms
  - First, we'll take a look at arrays, which will allow us to
    organize large numbers of similar pieces of data.
  - Next we'll look at structs, which allow us to group finite numbers
    of disparately typed data.
  - Then, we'll take our first look at functions, which are the
    primary mechanism to organize and group operations for our algorithms.
  - Last, we'll briefly look at some potentially confusing features
    introduced by the book which, in my opinion, you should avoid
    despite their existing for very good reasons.
  #+END_NOTES
* Arrays
  #+BEGIN_NOTES
  - An array in C represents an ordered set of homogeneously-typed
    data. It lets us keep a collection of similar data to be
    referenced under a single identifier.
  #+END_NOTES
** Defining Arrays
   #+BEGIN_NOTES
   - This line shows how we can define an array of ints assigned to
     the identified "numbers" which is capable of holding 5 values.
   - The square brackets here are called the "subscript operator", and
     will also be used when accessing elements of the array.
   - The memory for these values is allocated linearly in memory,
     which will help us understand more about how they work shortly.
   - We can also initialize an array when it is defined by placing the
     values to be assigned to its elements in curly brackets.
   #+END_NOTES
   #+BEGIN_SRC c
   int numbers[5];
   #+END_SRC
   #+BEGIN_SRC c
   int numbers[5] = {1, 2, 3, 4, 5};
   #+END_SRC
** Using Arrays
   #+BEGIN_NOTES
   - The subscript operator is used to access elements of an
     array. The number between the brackets is the subscript, but is
     more commonly known as the index.
   - Array indices start at 0. This is because this is actually used
     as a memory offset. That is, the first element is 0 integer-sized
     memory locations away from the beginning of the array in memory,
     the next element is 1 integer-sized memory location away from the
     beginning of the array, and so on.
   - As demonstrated here, the use of the subscript operator works
     with indices like this on any statement once an array has been
     declared. So, we can use it to access the array elements for
     assignment or to reference specific elements of the array.
   #+END_NOTES
   #+BEGIN_SRC c
   numbers[0] = 2;
   numbers[1] = 3;
   numbers[2] = 5;
   numbers[3] = 7;
   numbers[4] = 11;
   #+END_SRC
   #+BEGIN_SRC c
   int five = numbers[2];
   #+END_SRC
** Array Types
   #+BEGIN_NOTES
   - Arrays may be declared of any type, not just integers.
   - This includes even more complex types than the number types we've
     learned about so far.
   - Declaring an array of some type simply reserves an amount of
     memory large enough to store the requisite amount of data.
   #+END_NOTES
   #+BEGIN_SRC c
   char letters[26];
   float decimals[2] = {1.618, 3.14};
   #+END_SRC
** Multi-Dimensional Arrays
   #+BEGIN_NOTES
   - Because arrays can be of any type, that means they can also be
     arrays of arrays. These are known as multidimensional arrays.
   - With the set of features we've learned so far, for now any array
     must contain arrays of uniform size. In the future we'll learn
     mechanisms that allow us to keep differently-sized arrays
     together as a collection.
   #+END_NOTES
   #+BEGIN_SRC c
   int pairs[3][2];
   pairs[0] = {1, 4};
   pairs[1] = {2, 5};
   pairs[2] = {3, 6};
   int five = pairs[2][1] - pairs[0][1]; /* 6 - 1 */
   int three = five - pairs[1][0];       /* 5 - 2 */
   #+END_SRC
* Structs
  #+BEGIN_NOTES
  - While an array can let us keep an ordered collection of similar
    data, a struct is an unordered composite data types used for
    storing heterogeneously-typed data of fixed size. This is similar
    to a "record" type in other languages.
  #+END_NOTES
** Struct Basics
   #+BEGIN_NOTES
   - There are many situations where it can become cumbersome to store
     multi-part data as separate variables. This can quickly pollute
     the set of identifiers.
   - When multiple instances of some multi-part data need to be
     stored, usually a struct is the answer.
   - Struct members are accessed with the dot operator, similar to the
     way array elements are accessed with the subscript
     operator. However, rather than an index, struct members are
     accessed by their member identifier.
   #+END_NOTES
   #+BEGIN_SRC c
   int i = 2;
   char c = 'c';
   float f = 1.618;
   #+END_SRC
   #+BEGIN_SRC c
   struct nums {
       int i;
       char c;
       float f;
   };
   struct nums n;
   n.i = 2;
   n.c = 'c';
   n.f = 1.618;
   #+END_SRC
** Initializing Structs
   #+BEGIN_NOTES
   - A struct can be initialized similarly to an array by using curly
     braces.
   - Initial values for a struct are placed inside curly braces in the
     order they are declared in the struct. However, a struct can also
     be declared by explicitly declaring each member inside the curly
     braces, which negates the necessity of ordering the members the
     same way they are declared.
   #+END_NOTES
   #+BEGIN_SRC c
   struct nums n = {2, 'c', 1.618};
   struct nums n2 = {.f = 6.28, .c = 'A', i = 0};
   #+END_SRC
** Compound Literals
   #+BEGIN_NOTES
   - A struct can also be assigned after its declaration by using a
     concept called a compound literal
   - This is done by using the type cast operator, which informs the
     compiler that the literal collection in braces conforms to the
     struct type we are attempting to assign it to.
   - This is our first glimpse of the type cast operator, but we'll
     become much more familiar with it in the coming sections of the course.
   #+END_NOTES
   #+BEGIN_SRC c
   struct nums n;
   n = (struct nums) {2, 'c', 1.618};
   #+END_SRC
