session02/lab02.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Computer Science Fundamentals</title>
<meta name="author" content="(Detroit Labs Dev Coaching)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/league.css" id="theme"/>

<link rel="stylesheet" href="./presentation.css"/>
<link rel="stylesheet" href="./reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Computer Science Fundamentals</h1><h2 class="author">Detroit Labs Dev Coaching</h2><h2 class="date">2018</h2>
</section>

<section>
<section id="slide-org5beab85">
<h2 id="org5beab85">Lab 2</h2>
<aside class="notes">
<ul>
<li>To go along with our discussion of data structures and algorithms,
this section of the book is going to introduce some of the tools
that will assist us in developing more complicated data structures
and algorithms</li>
<li>First, we'll take a look at arrays, which will allow us to
organize large numbers of similar pieces of data.</li>
<li>Next we'll look at structs, which allow us to group finite numbers
of disparately typed data.</li>
<li>Then, we'll take our first look at functions, which are the
primary mechanism to organize and group operations for our algorithms.</li>
<li>Last, we'll briefly look at some potentially confusing features
introduced by the book which, in my opinion, you should avoid
despite their existing for very good reasons.</li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org73f6e90">
<h2 id="org73f6e90">Arrays</h2>
<aside class="notes">
<ul>
<li>An array in C represents an ordered set of homogeneously-typed
data. It lets us keep a collection of similar data to be
referenced under a single identifier.</li>

</ul>

</aside>
</section>
<section id="slide-org7da5f02">
<h3 id="org7da5f02">Defining Arrays</h3>
<aside class="notes">
<ul>
<li>This line shows how we can define an array of ints assigned to
the identified "numbers" which is capable of holding 5 values.</li>
<li>The square brackets here are called the "subscript operator", and
will also be used when accessing elements of the array.</li>
<li>The memory for these values is allocated linearly in memory,
which will help us understand more about how they work shortly.</li>
<li>We can also initialize an array when it is defined by placing the
values to be assigned to its elements in curly brackets.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >int numbers[5];
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >int numbers[5] = {1, 2, 3, 4, 5};
</code></pre>
</div>
</section>
<section id="slide-orgf0d798b">
<h3 id="orgf0d798b">Using Arrays</h3>
<aside class="notes">
<ul>
<li>The subscript operator is used to access elements of an
array. The number between the brackets is the subscript, but is
more commonly known as the index.</li>
<li>Array indices start at 0. This is because this is actually used
as a memory offset. That is, the first element is 0 integer-sized
memory locations away from the beginning of the array in memory,
the next element is 1 integer-sized memory location away from the
beginning of the array, and so on.</li>
<li>As demonstrated here, the use of the subscript operator works
with indices like this on any statement once an array has been
declared. So, we can use it to access the array elements for
assignment or to reference specific elements of the array.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >numbers[0] = 2;
numbers[1] = 3;
numbers[2] = 5;
numbers[3] = 7;
numbers[4] = 11;
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >int five = numbers[2];
</code></pre>
</div>
</section>
<section id="slide-org2707546">
<h3 id="org2707546">Array Types</h3>
<aside class="notes">
<ul>
<li>Arrays may be declared of any type, not just integers.</li>
<li>This includes even more complex types than the number types we've
learned about so far.</li>
<li>Declaring an array of some type simply reserves an amount of
memory large enough to store the requisite amount of data.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >char letters[26];
float decimals[2] = {1.618, 3.14};
</code></pre>
</div>
</section>
<section id="slide-orgc30ccea">
<h3 id="orgc30ccea">Multi-Dimensional Arrays</h3>
<aside class="notes">
<ul>
<li>Because arrays can be of any type, that means they can also be
arrays of arrays. These are known as multidimensional arrays.</li>
<li>With the set of features we've learned so far, for now any array
must contain arrays of uniform size. In the future we'll learn
mechanisms that allow us to keep differently-sized arrays
together as a collection.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >int pairs[3][2];
pairs[0] = {1, 4};
pairs[1] = {2, 5};
pairs[2] = {3, 6};
int five = pairs[2][1] - pairs[0][1]; /* 6 - 1 */
int three = five - pairs[1][0];       /* 5 - 2 */
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org4a42515">
<h2 id="org4a42515">Structs</h2>
<aside class="notes">
<ul>
<li>While an array can let us keep an ordered collection of similar
data, a struct is an unordered composite data types used for
storing heterogeneously-typed data of fixed size. This is similar
to a "record" type in other languages.</li>

</ul>

</aside>
</section>
<section id="slide-orgf420921">
<h3 id="orgf420921">Struct Basics</h3>
<aside class="notes">
<ul>
<li>There are many situations where it can become cumbersome to store
multi-part data as separate variables. This can quickly pollute
the set of identifiers.</li>
<li>When multiple instances of some multi-part data need to be
stored, usually a struct is the answer.</li>
<li>Struct members are accessed with the dot operator, similar to the
way array elements are accessed with the subscript
operator. However, rather than an index, struct members are
accessed by their member identifier.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >int i = 2;
char c = 'c';
float f = 1.618;
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >struct nums {
    int i;
    char c;
    float f;
};
struct nums n;
n.i = 2;
n.c = 'c';
n.f = 1.618;
</code></pre>
</div>
</section>
<section id="slide-orga6f98f4">
<h3 id="orga6f98f4">Initializing Structs</h3>
<aside class="notes">
<ul>
<li>A struct can be initialized similarly to an array by using curly
braces.</li>
<li>Initial values for a struct are placed inside curly braces in the
order they are declared in the struct. However, a struct can also
be declared by explicitly declaring each member inside the curly
braces, which negates the necessity of ordering the members the
same way they are declared.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >struct nums n = {2, 'c', 1.618};
struct nums n2 = {.f = 6.28, .c = 'A', i = 0};
</code></pre>
</div>
</section>
<section id="slide-org7903680">
<h3 id="org7903680">Compound Literals</h3>
<aside class="notes">
<ul>
<li>A struct can also be assigned after its declaration by using a
concept called a compound literal</li>
<li>This is done by using the type cast operator, which informs the
compiler that the literal collection in braces conforms to the
struct type we are attempting to assign it to.</li>
<li>This is our first glimpse of the type cast operator, but we'll
become much more familiar with it in the coming sections of the course.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >struct nums n;
n = (struct nums) {2, 'c', 1.618};
</code></pre>
</div>
</section>
