session02/lab02.org
** Structs and Arrays
   #+BEGIN_NOTES
   - Earlier I told you that we can create an array of any valid type,
     and that holds true for compound types such as structs.
   - Just like any other array element, we can reference a struct that
     is part of an array by its index, after which it we can access
     its members
   - Similarly, it's perfectly valid to allow arrays as members of a struct.
   - Array members of a struct that are dereferenced from their struct
     can then be accessed using the subscript operator as normal.
   #+END_NOTES
   #+BEGIN_SRC c
   struct nums ns[3];
   ns[0] = {2, 'c', 1.618};
   ns[0].c == 'c';
   #+END_SRC
   #+BEGIN_SRC c
   struct stuff { char c; int nums[5]; };
   struct stuff s = { 's', {1, 2, 3, 4, 5} };
   int three = s.nums[2];
   #+END_SRC
** Structs of Structs
   #+BEGIN_NOTES
   - One last thing about structs: seeing as they can be composed of
     any valid type, it's also perfectly valid and quite common to
     other structs as members of a struct to create more complex
     compound types.
   #+END_NOTES
   #+BEGIN_SRC c
   struct combined {
       struct nums;
       struct stuff;
   }
   struct combined c = { n, s };
   float a_float = combined.nums.f;
   #+END_SRC
* Functions
  #+BEGIN_NOTES
  - In the same way that arrays and records help us organize data in
    our programs, functions can help us organize operations to
    simplify our programs and better represent algorithms.
  #+END_NOTES
** Basic Functions
   #+BEGIN_NOTES
   - It should be no surprise that C gives us the capability to
     separate our programs into functions.
   - The function below has a signature showing it returns nothing
     (void) and takes no arguments (void). It simply prints a message
     to the user and then returns after executing its only statement.
   - A function is called by using parentheses after its
     identifier. If the function takes arguments, the arguments will
     go between these parentheses.
   #+END_NOTES
   #+BEGIN_SRC c
   void notifyUser(void) {
       printf("User, a thing happened!\n");
   }
   /* ... */
   notifyUser();
   #+END_SRC
** Function Arguments & Lexical Scoping
   #+BEGIN_NOTES
   - Functions can also take arguments. This function takes a single
     integer as an argument, as indicated by the declaration within
     the parentheses after its identifier.
   - In this case, the function receives a copy of the argument, so
     the original value would be unaffected if that value of n were
     modified.
   - Similarly, the values of n and i in this function body are
     unavailable to other functions, including main, as identifiers
     are only available within the scope (set of braces) that they are
     defined.
   #+END_NOTES
   #+BEGIN_SRC c
   void showFiveTimes(int n) {
        int i = 5;
        while (i > 0) {
             printf("I am printing %i", n);
             --i;
        }
   }
   /* ... */
   showFiveTimes(0);
   #+END_SRC
** Returning Values
   #+BEGIN_NOTES
   - Functions can also return values. This function takes two
     arguments and returns an int. The return value of the function is
     placed before the function's identifier. This will also cause the
     compiler to enforce that this function does indeed return a value
     of the appropriate type.
   - The default return type for all functions that do not declare a
     return type is int, however I will suggest that you always
     declare an explicit return type for your functions to assist
     yourself and others looking at your code, as well as the compiler
     on occasion.
   #+END_NOTES
   #+BEGIN_SRC c
   int gcd(int a, int b) {
       int tmp;
       while(b != 0) {
           tmp = a % b;
           a = b;
           b = tmp;
       }
       return a;
   }
   #+END_SRC
** Functions, Arrays, and Assignments
   #+BEGIN_NOTES
   - A note about arrays and functions. Functions can certainly take
     arrays as arguments, however they work slightly differently than
     normal arguments.
   - Rather than receiving a copy of the argument, in the case of
     array arguments, functions only receive a pointer to the memory
     location of the array. Because of this, not only does the
     function not receive information about how large the array is,
     but it can also alter the value of the array in the context that
     it was originally used in!
   - This behavior may seem bizarre, but we'll be learning in the next
     session what is actually going on here. In truth, C is saving us
     some typing by performing a bit of syntactic magic for us because
     passing arrays to functions is a very common operation.
   - For now, just remember that if you pass an array as an argument
     to a function, you will also need to pass an additional argument
     for how big the array is as well as knowing that if you modify
     the contents of the array within the argument that it will affect
     the original array back in the context it was passed from!
   #+END_NOTES
   #+BEGIN_SRC c
   void plusOne(int n, int array[]) {
       for(int i = 0; i < n; ++i) {
           array[i] += 1;
       }
   }
   /* ... */
   int nums = {1, 2, 3};
   plusOne(3, nums);
   for(int i; i < 3; ++i) {
       printf("%i ", nums[i]);
   }
   /* 2 3 4 */
   #+END_SRC
** Recursion
   #+BEGIN_NOTES
   - Functions can call other functions, and that includes calling
     themselves. This means that some algorithms can be re-written
     much more concisely and with simpler operations.
   - However, it should be noted that each call to a function takes up
     a stack frame which has a limited amount of space depending on
     the system it's being compiled and executed on, while normal
     looping constructs do not take up additional stack frames. This
     means that while it might be simpler or more elegant to write
     certain kinds of algorithms, it might not be a good idea because
     if you run out of stack frames, your program will crash!
   #+END_NOTES
   #+BEGIN_SRC c
   int gcd(int a, int b) {
       int tmp;
       while(b != 0) {
           tmp = a % b;
           a = b;
           b = tmp;
       }
       return a;
   }
   #+END_SRC
   #+BEGIN_SRC c
   int gcd(int a, int b) {
       if(b == 0) return a;
       else return gcd(b, a % b);
   }
   #+END_SRC
* Danger Zone
  #+BEGIN_NOTES
  - The book introduces a few concepts in this session's chapters that
    I consider to be anti-patterns for good programming practice and I
    wanted to take a moment to point them out.
  - These features exist for very specific systems programming reasons
    in C, but do not necessarily make for good programming practice.
  #+END_NOTES
