session02/lab02.html
<section id="slide-orgac177fd">
<h3 id="orgac177fd">Structs and Arrays</h3>
<aside class="notes">
<ul>
<li>Earlier I told you that we can create an array of any valid type,
and that holds true for compound types such as structs.</li>
<li>Just like any other array element, we can reference a struct that
is part of an array by its index, after which it we can access
its members</li>
<li>Similarly, it's perfectly valid to allow arrays as members of a struct.</li>
<li>Array members of a struct that are dereferenced from their struct
can then be accessed using the subscript operator as normal.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >struct nums ns[3];
ns[0] = {2, 'c', 1.618};
ns[0].c == 'c';
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >struct stuff { char c; int nums[5]; };
struct stuff s = { 's', {1, 2, 3, 4, 5} };
int three = s.nums[2];
</code></pre>
</div>
</section>
<section id="slide-org1394264">
<h3 id="org1394264">Structs of Structs</h3>
<aside class="notes">
<ul>
<li>One last thing about structs: seeing as they can be composed of
any valid type, it's also perfectly valid and quite common to
other structs as members of a struct to create more complex
compound types.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >struct combined {
    struct nums;
    struct stuff;
}
struct combined c = { n, s };
float a_float = combined.nums.f;
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org854c41e">
<h2 id="org854c41e">Functions</h2>
<aside class="notes">
<ul>
<li>In the same way that arrays and records help us organize data in
our programs, functions can help us organize operations to
simplify our programs and better represent algorithms.</li>

</ul>

</aside>
</section>
<section id="slide-orge2c2945">
<h3 id="orge2c2945">Basic Functions</h3>
<aside class="notes">
<ul>
<li>It should be no surprise that C gives us the capability to
separate our programs into functions.</li>
<li>The function below has a signature showing it returns nothing
(void) and takes no arguments (void). It simply prints a message
to the user and then returns after executing its only statement.</li>
<li>A function is called by using parentheses after its
identifier. If the function takes arguments, the arguments will
go between these parentheses.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >void notifyUser(void) {
    printf("User, a thing happened!\n");
}
/* ... */
notifyUser();
</code></pre>
</div>
</section>
<section id="slide-org4325976">
<h3 id="org4325976">Function Arguments &amp; Lexical Scoping</h3>
<aside class="notes">
<ul>
<li>Functions can also take arguments. This function takes a single
integer as an argument, as indicated by the declaration within
the parentheses after its identifier.</li>
<li>In this case, the function receives a copy of the argument, so
the original value would be unaffected if that value of n were
modified.</li>
<li>Similarly, the values of n and i in this function body are
unavailable to other functions, including main, as identifiers
are only available within the scope (set of braces) that they are
defined.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >void showFiveTimes(int n) {
     int i = 5;
     while (i > 0) {
          printf("I am printing %i", n);
          --i;
     }
}
/* ... */
showFiveTimes(0);
</code></pre>
</div>
</section>
<section id="slide-org44a3cee">
<h3 id="org44a3cee">Returning Values</h3>
<aside class="notes">
<ul>
<li>Functions can also return values. This function takes two
arguments and returns an int. The return value of the function is
placed before the function's identifier. This will also cause the
compiler to enforce that this function does indeed return a value
of the appropriate type.</li>
<li>The default return type for all functions that do not declare a
return type is int, however I will suggest that you always
declare an explicit return type for your functions to assist
yourself and others looking at your code, as well as the compiler
on occasion.</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >int gcd(int a, int b) {
    int tmp;
    while(b != 0) {
        tmp = a % b;
        a = b;
        b = tmp;
    }
    return a;
}
</code></pre>
</div>
</section>
<section id="slide-orga674a37">
<h3 id="orga674a37">Functions, Arrays, and Assignments</h3>
<aside class="notes">
<ul>
<li>A note about arrays and functions. Functions can certainly take
arrays as arguments, however they work slightly differently than
normal arguments.</li>
<li>Rather than receiving a copy of the argument, in the case of
array arguments, functions only receive a pointer to the memory
location of the array. Because of this, not only does the
function not receive information about how large the array is,
but it can also alter the value of the array in the context that
it was originally used in!</li>
<li>This behavior may seem bizarre, but we'll be learning in the next
session what is actually going on here. In truth, C is saving us
some typing by performing a bit of syntactic magic for us because
passing arrays to functions is a very common operation.</li>
<li>For now, just remember that if you pass an array as an argument
to a function, you will also need to pass an additional argument
for how big the array is as well as knowing that if you modify
the contents of the array within the argument that it will affect
the original array back in the context it was passed from!</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >void plusOne(int n, int array[]) {
    for(int i = 0; i < n; ++i) {
        array[i] += 1;
    }
}
/* ... */
int nums = {1, 2, 3};
plusOne(3, nums);
for(int i; i < 3; ++i) {
    printf("%i ", nums[i]);
}
/* 2 3 4 */
</code></pre>
</div>
</section>
<section id="slide-orgf05ebb5">
<h3 id="orgf05ebb5">Recursion</h3>
<aside class="notes">
<ul>
<li>Functions can call other functions, and that includes calling
themselves. This means that some algorithms can be re-written
much more concisely and with simpler operations.</li>
<li>However, it should be noted that each call to a function takes up
a stack frame which has a limited amount of space depending on
the system it's being compiled and executed on, while normal
looping constructs do not take up additional stack frames. This
means that while it might be simpler or more elegant to write
certain kinds of algorithms, it might not be a good idea because
if you run out of stack frames, your program will crash!</li>

</ul>

</aside>
<div class="org-src-container">

<pre><code class="c" >int gcd(int a, int b) {
    int tmp;
    while(b != 0) {
        tmp = a % b;
        a = b;
        b = tmp;
    }
    return a;
}
</code></pre>
</div>
<div class="org-src-container">

<pre><code class="c" >int gcd(int a, int b) {
    if(b == 0) return a;
    else return gcd(b, a % b);
}
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgeb41ab7">
<h2 id="orgeb41ab7">Danger Zone</h2>
<aside class="notes">
<ul>
<li>The book introduces a few concepts in this session's chapters that
I consider to be anti-patterns for good programming practice and I
wanted to take a moment to point them out.</li>
<li>These features exist for very specific systems programming reasons
in C, but do not necessarily make for good programming practice.</li>

</ul>

</aside>
</section>
